{
    "flipbookData": [
      {
        "name": "Envergan Magazine (2024)",
        "volume": 77,
        "issue": 7,
        "img": "EnverganMag24",
        "url": "https://online.fliphtml5.com/hncrb/kjpe/index.html?fbclid=IwAR0cxBQyK23MXHv0XEyQwwdvtbkTblfhRzeU7PKZn_kK6aRmG9eS2aW9WPQ",
        "date_released": "2024-02-16",
        "description": "As we explore the contents of this year’s Envergan magazine, let us pause and contemplate our voyage. Last year, Manuel S. Enverga University Foundation’s 76th year centered around transcending excellence. Now, entering our 77th year, we are venturing beyond borders– a journey of excellence towards fostering ASEAN harmony. In honoring our founder’s legacy, we haven’t simply relied on past achievements. Instead, we have continued to make significant progress, experiencing growth, and achieving global competitiveness across all facets. This milestone not only marks an accomplishment for our institution but also stands as evidence of the collaborative efforts of every student, employee, faculty, and stakeholder. As students, we hold a crucial role in commemorating this achievement. Beyond being mere learners, we serve as ambassadors for the greater good and the advancement of our institution. Let us seize this opportunity to contribute to the enduring legacy of excellence as we progress forward."
      },
      {
        "name": "Tabloid (2023)",
        "volume": 74,
        "issue": 3,
        "img": "Tabloid24",
        "url": "https://online.fliphtml5.com/hncrb/csut/index.html?fbclid=IwAR0vGzCbu3BIxjf_HnRdka3_x95zYO2JcY_493xX3sh_hofFdOc3QLnBHtM#p=1",
        "date_released": "2024-02-12",
        "description": "After almost five years, The Luzonian is thrilled to announce the availability of our print releases. Look back on the stories of 2023 and claim your tabloid (September-October) at The Luzonian's office located in the OSAS Building starting on Feb. 12."
      },
      {
        "name": "Newsletter (2023)",
        "volume": 74,
        "issue": 2,
        "img": "Newsletter24",
        "url": "https://online.fliphtml5.com/hncrb/xcib/index.html?fbclid=IwAR3Juxu4nR0oui8GDDA0LcNLKGgHSVA1fNemMSj14hCyS1Hqz4zsVzACVcs#p=1",
        "date_released": "2024-02-12",
        "description": "After almost five years, The Luzonian is thrilled to announce the availability of our print releases. Look back on the stories of 2023 and claim your newsletter (June to August) at The Luzonian's office located in the OSAS Building starting on Feb. 12."
      },
      {
        "name": "Fiestanglaw (2023)",
        "volume": 75,
        "issue": 1,
        "img": "Fiestanglaw23",
        "url": "https://online.fliphtml5.com/rrcpy/fial/?fbclid=IwAR3BFm4vtM0vK-gnSDIDuwoFHuiEFGAi4hqaXXTeTDJNWd1XsY8aiX8iagk#p=1",
        "date_released": "2023-12-18",
        "description": "The Luzonian presents its highly anticipated 2023 Special Flash Issue, honoring the lively Fiestanglaw Year 13 celebration. This annual edition embodies our publication's essence of cultural richness and community spirit in celebrating the Christmas season."      }
    ]
  }
  